# PlanViewCutPlaneHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlanViewCutPlaneHeight Property
ParameterTypeId Class See Also
---
"Cut Plane Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlanViewCutPlaneHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlanViewCutPlaneHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlanViewCutPlaneHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace